# Join and Append Data Frame

## Join

In [1]:
import pandas as pd

In [2]:
df_1 = pd.DataFrame({"A": [1,2,3,4], "B": [11,12, 13, 14]})
df_2 = pd.DataFrame({"C": [10,20,30,40], "D": [11,22, 33, 44]})

df_1.join(df_2)

   A   B   C   D
0  1  11  10  11
1  2  12  20  22
2  3  13  30  33
3  4  14  40  44

In [4]:
df_1 = pd.DataFrame({"A": [1,2,3,4], "B": [11,12, 13, 14]}, index=["a", "b", "c", "d"])
df_2 = pd.DataFrame({"C": [10,20 ], "D": [11,22]})

df_1.join(df_2)

   A   B   C   D
a  1  11 NaN NaN
b  2  12 NaN NaN
c  3  13 NaN NaN
d  4  14 NaN NaN

In [7]:
df_1 = pd.DataFrame({"A": [1,2,3,4], "B": [11,12, 13, 14]}, index=["a", "b", "c", "d"])
df_2 = pd.DataFrame({"C": [10,20 ], "D": [11,22]}, index=["a", "b"])

df_2.join(df_1)

    C   D  A   B
a  10  11  1  11
b  20  22  2  12

In [8]:
df_1 = pd.DataFrame({"A": [1,2,3,4], "B": [11,12, 13, 14]}, index=["a", "b", "c", "d"])
df_2 = pd.DataFrame({"C": [10,20 ], "D": [11,22]}, index=["a", "b"])

df_2.join(df_1, how="left")

    C   D  A   B
a  10  11  1  11
b  20  22  2  12

In [9]:
df_1 = pd.DataFrame({"A": [1,2,3,4], "B": [11,12, 13, 14]}, index=["a", "b", "c", "d"])
df_2 = pd.DataFrame({"C": [10,20 ], "D": [11,22]}, index=["a", "b"])

df_2.join(df_1, how="right")

      C     D  A   B
a  10.0  11.0  1  11
b  20.0  22.0  2  12
c   NaN   NaN  3  13
d   NaN   NaN  4  14

In [10]:
df_1 = pd.DataFrame({"A": [1,2,3,4], "B": [11,12, 13, 14]}, index=["a", "b", "c", "d"])
df_2 = pd.DataFrame({"C": [10,20 ], "D": [11,22]}, index=["a", "b"])

df_2.join(df_1, how="inner")

    C   D  A   B
a  10  11  1  11
b  20  22  2  12

In [11]:
df_1 = pd.DataFrame({"A": [1,2,3,4], "B": [11,12, 13, 14]}, index=["a", "b", "c", "d"])
df_2 = pd.DataFrame({"C": [10,20 ], "D": [11,22]}, index=["a", "b"])

df_2.join(df_1, how="outer")

      C     D  A   B
a  10.0  11.0  1  11
b  20.0  22.0  2  12
c   NaN   NaN  3  13
d   NaN   NaN  4  14

## Append  -- Deprecated

In [13]:
df_1 = pd.DataFrame({"A": [1,2,3,4], "B": [11,12, 13, 14]}, index=["a", "b", "c", "d"])
df_2 = pd.DataFrame({"C": [10,20 ], "D": [11,22]}, index=["a", "b"])